Revit 2027 API
BuiltInFailures.EditingFailures.TemporaryChangesTransparentPermissions Property
 Permission to edit the element cannot be obtained. Changes will be temporary, and will not be saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TemporaryChangesTransparentPermissions { get; }
Public Shared ReadOnly Property TemporaryChangesTransparentPermissions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TemporaryChangesTransparentPermissions {
	FailureDefinitionId^ get ();
}
static member TemporaryChangesTransparentPermissions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace